# Question 1

In [1]:
import pandas as pd

azubi_business = {
    'product_id':[23,96,97,15,87],
    'name':['computer','Python Workout','Pandas Workout','banana','sandwich'],
    'wholesale_price':[500,35,35,0.5,3],
    'retail_price':[1000,75,75,1,5],
    'sales':[100,1000,500,200,300]
}

df = pd.DataFrame(azubi_business)

df

             name  product_id  retail_price  sales  wholesale_price
0        computer          23          1000    100            500.0
1  Python Workout          96            75   1000             35.0
2  Pandas Workout          97            75    500             35.0
3          banana          15             1    200              0.5
4        sandwich          87             5    300              3.0

# QUESTION 2

In [2]:
df['net_revenue'] = (df['retail_price'] - df['wholesale_price']) * df['sales']
df
#print(profit)

,name,product_id,retail_price,sales,wholesale_price,net_revenue
0,computer,23,1000,100,500.0,50000.0
1,Python Workout,96,75,1000,35.0,40000.0
2,Pandas Workout,97,75,500,35.0,20000.0
3,banana,15,1,200,0.5,100.0
4,sandwich,87,5,300,3.0,600.0

# QUESTION 3

In [3]:
total_revenue = df['net_revenue'].sum()

print(f'Total Revenue: USD {total_revenue}')

Total Revenue: USD 110700.0

# QUESTION 4

In [ ]:
#df['products_with_higher_retail'] = (df['retail_price']) > (2*df['wholesale_price'])

higher_retail= df[(df['retail_price']) > (2*df['wholesale_price'])]

print(higher_retail[['product_id','name']])

# QUESTION 6

In [4]:
df['new_net_revenue'] = (df['retail_price'] - (df['wholesale_price'] * 0.7))* df['sales']
df

,name,product_id,retail_price,sales,wholesale_price,net_revenue,new_net_revenue
0,computer,23,1000,100,500.0,50000.0,65000.0
1,Python Workout,96,75,1000,35.0,40000.0,50500.0
2,Pandas Workout,97,75,500,35.0,20000.0,25250.0
3,banana,15,1,200,0.5,100.0,130.0
4,sandwich,87,5,300,3.0,600.0,870.0